src/Documents/ИзменениеПрайса/ИзменениеПрайса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеПрайса</name>
  <registerRecords>InformationRegister.ПрайсПоТарифам</registerRecords>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>CatalogRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/ПрайсПоТарифам/ПрайсПоТарифам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрайсПоТарифам</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипНоменклатуры</name>
    <type>
      <types>CatalogRef.ТипыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ИзменениеПрайса/ObjectModule.bsl
//@strict-types

Процедура ОбработкаПроведения(Отказ, Режим)
	Движение = Движения.ПрайсПоТарифам.Добавить();
	Движение.Период = Дата;
	Движение.ТипНоменклатуры = ТипНоменклатуры;
	Движение.Тариф = Тариф;
	Движения.ПрайсПоТарифам.Записать(Истина);
КонецПроцедуры
